/******************************************************************************
 *  题目说明：寻找两个有序数组的公共部分
 *  解题思路：对于数列a和b，分别设置两个指针指向两个数列的头指针
                1）若a[i]小于b[j]，则i++。
                2）若a[i]大于b[j]，则j++。
                3）若a[i]等于b[j]，则打印该数，并i++;j++
             当其中任意一个数组到达尾部算法结束。
             时间复杂度：O(n+m),n和m是两个数组的长度
******************************************************************************/
#include <stdio.h>

void getCommonElement(int a[], int b[], int a_len, int b_len)
{
    int i = 0, j = 0;

    while (i < a_len && j < b_len)
    {
        if (a[i] == b[j])
        {
            printf("%d ",a[i]);
            i++;
            j++;
        }
        else if (a[i] > b[j])
        {
            j++;
        }
        else
        {
            i++;
        }
    }
}

int main()
{
    int a[10] = {1,3,5,6,7,9,10,13,17,21};
    int b[10] = {3,4,6,8,9,10,11,12,15,17};

    getCommonElement(a,b,10,10);
    return 0;
}