/******************************************************************************
 *  题目说明：找出数组中只出现一次的数字，其它数字都出现了两次(或者偶数次)
    解法：对所有的数异或
         如果 a=b, 那么，a^b = 0
         因为 0^x=x
         所以只要对所有的数异或就会得到只出现一次的数了  
******************************************************************************/
#include <stdio.h>

int findOnceNumber(int a[], int len)
{
    int value = 0;

    for (int i = 0; i < len; i++)
    {
        value ^= a[i];
    }
    return value;
}

int main()
{
    int tst[11] = {1,2,3,4,5,6,1,2,3,4,5};

    printf("once number:%d\n",findOnceNumber(tst, 11));
    return 0;
}