/******************************************************************************
 *  题目说明：输入一个正数n,输出所有和为n的连续正数序列。例如，输入15,由于
             1+2+3+4+5=4+5+6=7+8=15,所以输出3个连续序列1~5、4~6和7~8.
    解法：首先记录开始位置，再用另外一个变量依次递增，定义总数首先等于初始值，总数加
         依次递增的数后若等于传入的值，打印。若小于则继续，大于则跳出，进行下一轮数字轮询。
******************************************************************************/
#include <stdio.h>

void sumEqualCertainValue(int n)
{
    int i, j;
    int count;

    for (i = 1; i < (n/2 + 1); i++)
    {
        count = i;
        for (j = i+1; j <= (n/2 + 1); j++)
        {
            count += j;
            if (count == n)
            {
                printf("%d~%d\n",i,j);
                break;
            }
            if (count > n)
            {
                break;
            }
        }
    }
}

int main()
{
    int n;

    while (1)
    {
        printf("input n: ");
        scanf("%d",&n);
        sumEqualCertainValue(n);
    }
    return 0;
}